{
  "projects": [
    {
      "id": 1,
      "slug": "calendar-kempinski-2025",
      "title": "CALENDAR KEMPINSKI 2025",
      "innerTitle": "KEMPINSKI 2025",
      "date": "DECEMBER 2025",
      "client": "VOKODE | FREELANCE",
      "type": "EXPERIENCE SHOWCASE",
      "imageUrl": "/images/p1.webp",
      "imagesProject": ["/images/proj1/1.webp", "/images/proj1/2.webp"],
      "mainContent": ["This WebGL site was designed as a long-lasting celebration of Kempinski’s heritage, created for the 2025 Christmas season. The concept was to craft an interactive “time capsule” of the brand’s history, illustrating a stylized version of the very first hotel. Each window or case on the site acts as a portal — a glimpse into a story, a memory, or a moment from the past, allowing users to explore the evolution of the hotel and its legacy.",
            "With the goal of longevity, this platform is meant to grow as a digital archive, giving the brand a permanent space to celebrate its story, while offering users a layered, memorable experience that bridges past and present."],
      "details": {
        "agency": "Vokode",
        "position": "freelance",
        "stack": "Three.js ; GSAP ; React.js",
        "job": "Creative Developer ;",
        "status": "DONE ;",
        "link": "www.kempinski.com/en/advent-calendar"
      },
      "nextProject": "calendar-etam-2025",
      "colors" : ["#E9DB97","#F5F1E9","#9095AD"]
    },
    {
      "id": 2,
      "slug": "william-klein",
      "title": "WILLIAM KLEIN",
      "innerTitle": "WILLIAM KLEIN",
      "date": " DECEMBER 2025",
      "client": "VOKODE | IN-HOUSE",
      "type": "PORTFOLIO WEBSITE",
      "imageUrl": "/images/p2.webp",
      "imagesProject": ["/images/proj2/1.webp", "/images/proj2/2.webp", "/images/proj2/3.webp", "/images/proj2/4.webp", "/images/proj2/5.webp"],
      "mainContent": ["This project was commissioned by the William Klein Studio with the objective of expanding access to the life and work of William Klein through a dedicated web experience.",
            "Conceived as a digital extension rather than a simple showcase, the site offers a global and transversal view of the artist’s career. It connects the different facets of his practice — photography, cinema, painting, graphic work — into a single navigable space, allowing users to explore the breadth of his artistic journey.",
          "The experience is designed to provide context, continuity, and perspective, making visible the relationships between works, periods, and mediums. More than an archive, the project acts as a living interface, giving structure to a rich and multifaceted body of work while remaining accessible and open-ended."],
      "details": {
        "agency": "Vokode",
        "position": "in-house",
        "stack": "Next.js ; GSAP ;",
        "job": "Creative Developer ;",
        "status": "DONE ;",
        "link": "https://www.williamklein.fr/"

      },
      "nextProject": "chanel-atelier",
      "colors": ["#C2776D", "#4B5A49", "#F1E4D2"]
    },
    {
      "id": 3,
      "slug": "chanel-atelier",
      "title": "CHANEL ATELIER HAUTE JOAILLERIE",
      "innerTitle": "CHANEL HAUTE JOAILLERIE",
      "date": "JUNE 2025",
      "client": "VOKODE | IN-HOUSE",
      "type": "EXPERIENCE SHOWCASE",
      "link": "https://example.com/project3",
      "imageUrl": "/images/p3.webp",
      "imagesProject": ["/images/proj3/1.webp", "/images/proj3/2.webp", "/images/proj3/3.webp", "/images/proj3/4.webp", "/images/proj3/5.webp"],
      "mainContent": ["In collaboration with Chanel’s internal teams, I helped create an immersive WebGL experience that allows users to explore the maison’s ateliers, iconic pieces, and high jewelry techniques. The project was designed as a long-form digital journey, giving participants the opportunity to discover the details of each jewel and understand the craftsmanship behind them.",
            "My role focused on the development, optimization, and implementation of the 3D environment in WebGL. All assets and animations were baked to ensure smooth performance and visual fidelity. Every technical aspect — from lighting and material rendering to navigation and interactive elements — was crafted to reflect the elegance and precision of Chanel’s universe."],
      "details": {
        "agency": "Vokode",
        "position": "in-house",
        "stack": "Three.js ; GSAP ; Next.js",
        "job": "Creative Developer ;",
        "status": "DONE ;"
      },
      "nextProject": "macif",
      "colors": ["#BCD9F0", "#D4AF37", "#F5F0E8"]
    },
    {
      "id": 4,
      "slug": "macif",
      "title": "MACIF HOUSE INSURANCE",
      "innerTitle": "MACIF INSURANCE",
      "date": "MARCH 2025",
      "client": "VOKODE | IN-HOUSE",
      "type": "EXPERIENCE SHOWCASE",
      "link": "https://example.com/project4",
      "imageUrl": "/images/p4.webp",
      "imagesProject": ["/images/proj4/1.webp", "/images/proj4/2.webp", "/images/proj4/3.webp", "/images/proj4/4.webp", "/images/proj4/5.webp"],
      "mainContent": ["For Macif, we designed an immersive digital game inviting users to explore an interactive house. The goal was to discover key objects that reveal how Macif supports its clients in their daily lives, in a playful and engaging way.",
            "My role focused on development and UI implementation, ensuring the interface aligned perfectly with Macif’s design system. All assets and textures were baked for optimal performance, allowing the 3D environment to feel smooth, responsive, and visually clear.",
          "The final experience blends gamification, interactive storytelling, and brand education, offering users a memorable journey through Macif’s values and services, all within an engaging and intuitive digital environment."],
      "details": {
        "agency": "Vokode",
        "position": "in-house",
        "stack": "Three.js ; GSAP ; React.js ; Howler.js",
        "job": "Creative Developer ;",
        "status": "DONE ;",
        "link": "https://vosprojets.macif.fr/"
      },
      "nextProject": "IX-CHEL-ET-KIN",
      "colors": ["#D1D3C5","#6C6E85", "#99B19C"]
    },
    {
      "id": 5,
      "slug": "IX-CHEL-ET-KIN",
      "title": "IX CHEL ET KIN",
      "innerTitle": "IX CHEL ET KIN",
      "date": "JULY 2025",
      "client": "GOBELINS | SCHOOL PROJECT",
      "type": "INTERACTIVE INSTALLATION",
      "link": "https://example.com/project5",
      "imageUrl": "/images/p5.webp",
      "imagesProject": ["/images/proj5/1.webp", "/images/proj5/2.webp", "/images/proj5/3.webp", "/images/proj5/4.webp", "/images/proj5/5.webp"],
      "mainContent": ["“IX CHEL ET KIN” is a custom-built interactive installation that tells the story of the sun god and the moon goddess. The experience invites participants to place magnetized objects onto a surface, where each object is detected, identified, and tracked in real time to trigger visual and narrative interactions.",
            "Built using Three.js with a strong emphasis on 2D visuals, the project relies on a handcrafted system developed entirely from scratch. My role was centered on research and development: exploring and comparing technical possibilities, eliminating solutions that were either too costly or unfeasible, and designing accessible alternatives through extensive prototyping and testing.",
          "I worked on the full interactive pipeline — from Arduino data optimization and signal processing to the development of the installation and web interface using Python.",
        "“IX CHEL ET KIN” stands as a deeply experimental, handmade system, where technology, mythology, and interaction merge into a tangible and immersive installation."],
      "details": {
        "credits": "Agathe BOSCH ; Abishek Balasubramanian ; Affo Hamzine ; Fiona Ballaret ; Victor Sin",
        "status": "DONE",
        "stack": "NODE.JS ; THREE.JS ; ARDUINO ; Node.js ; Socket.io",
        "job": "Creative Developer ; R&D ; Interactive Systems & Prototyping"
      },
      "nextProject": "VRAIMENT",
      "colors": ["#EEE5DF", "#F3AD8D", "#615A6B"]
    },
    {
      "id": 6,
      "slug": "VRAIMENT",
      "title": "BOARD GAME - VRAIMENT?",
      "innerTitle": "VRAIMENT?",
      "date": "JULY 2024",
      "client": "GOBELINS | SCHOOL PROJECT",
      "type": "BOARD GAME / APP",
      "link": "https://example.com/project6",
      "imageUrl": "/images/p6.webp",
      "imagesProject": ["/images/proj6/1.webp", "/images/proj6/2.webp", "/images/proj6/3.webp", "/images/proj6/4.webp", "/images/proj6/5.webp"],
      "mainContent": ["As part of my final year at Gobelins in 2024, we developed “VraiMent?”, an innovative board game exploring memory, storytelling, and artificial intelligence. In this multiplayer game, players take turns sharing a personal memory with an AI assistant (powered by OpenAI’s API), which guides them through a structured conversation to capture key details and generate a fictional version of their memory. Two images are then produced — one representing the real memory and one the AI-generated fictional counterpart — and players must convince others which image corresponds to their actual memory.",
            "My role encompassed prototyping the game logic, integrating the AI API, developing the digital interface, and conducting user tests with board game enthusiasts to iterate and refine the experience. The project also aimed to provoke reflection on the handling of personal data by AI and the ethical considerations around image generation and artistic styles.",
          "“VraiMent?” invites players to engage creatively with AI, question the boundaries of memory and authorship, and experience storytelling in a playful yet thought-provoking way, bridging human imagination and artificial intelligence in an interactive format."],
      "details": {
        "credits": "Agathe BOSCH ; Chanel BITTON ; Wendy Paulos ; Nicolas Neveu ; Victor Sin",
        "status": "DONE",
        "stack": "Next.js ; GSAP; Howler.js ; Socket.io ; Node.js ; xState",
        "job": "Back-end Development ; Interactive 3D ; AI Experimentation"
      },
      "nextProject": "calendar-kempinski-2025",
      "colors": ["#717397", "#A48DAD", "#FFFFFF"]
    }
  ]
}
